{
  "backend/main.mo": "Minimal Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature mapping file listing audio-related feature IDs, affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend Valentine-themed components and utilities.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide providing steps and console checks to diagnose audio playback issues in deployments.",
  "frontend/index.css": "Tailwind-based global stylesheet defining Valentine-themed color variables, dark mode values, and UI base styles.",
  "frontend/index.html": "HTML entry point setting up fonts, metadata, and the root mount point for the app.",
  "frontend/README_AUDIO_SETUP.md": "Documentation describing how to configure local and external audio modes and how to reference audio files.",
  "frontend/src/App.tsx": "Main React application assembling the Valentine experience, handling intro overlay, background music, visuals, and page content.",
  "frontend/src/components/valentine/FloatingHearts.tsx": "Generates animated floating heart elements unless reduced-motion is enabled.",
  "frontend/src/components/valentine/RosePetalOverlay.tsx": "Creates dynamic falling rose petals or static emojis when reduced-motion is requested.",
  "frontend/src/components/valentine/RotatingOneLiners.tsx": "Cycles through cute one‑liner messages with hover‑pause and reduced‑motion handling.",
  "frontend/src/components/valentine/SurpriseReveal.tsx": "Interactive component that reveals a Valentine surprise, switching from a gift button to a coupon book with a playlist link.",
  "frontend/src/components/valentine/useIntroOverlayAudio.ts": "Custom hook that initializes ambient and confirmation audio, manages mute state, and handles interaction-based playback unlocking.",
  "frontend/src/components/valentine/ValentineBackgroundMusic.tsx": "Manages background music playback with preflight validation, error handling, and mute control tied to component activity.",
  "frontend/src/components/valentine/ValentineIntroOverlay.tsx": "Intro overlay with audio controls and an evasive 'No' button, guiding the user to accept before proceeding.",
  "frontend/src/deployDiagnostics.ts": "Diagnostics module that logs startup details and tracks resource load errors, media failures, and unhandled rejections.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on user identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading identities, login flow, and status flags.",
  "frontend/src/index.css": "Defines global Tailwind base styles and a Valentine-themed color palette with custom components and typography rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/utils/assetBase.ts": "Generates asset URLs using Vite’s BASE_URL, ensuring correct paths for SPA deployments.",
  "frontend/src/utils/audioPreflight.ts": "Performs validation of audio URLs using HEAD/GET requests, detecting HTML fallbacks, CORS issues, and non-audio responses.",
  "frontend/src/utils/resolveAudioUrl.ts": "Resolves audio sources by passing through absolute URLs or converting relative paths via getAssetUrl, with validation against malformed URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended colors mapped to CSS variables, typography, animations, and container settings.",
  "project_state.json": "Tracks project metadata, existing features, and new requests related to supporting external MP3 audio streaming."
}