{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report stub containing no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend Valentine's components, utilities, styles, and configuration files.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide outlining build checks, asset path issues, diagnostics logs, and steps for reporting deployment failures.",
  "frontend/index.css": "Tailwind-based global stylesheet defining Valentine's-themed OKLCH color variables and base styles with light/dark modes.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and the root element for the SPA.",
  "frontend/src/App.tsx": "Main React app assembling intro overlay, animations, hero section, surprise reveal, and diagnostics initialization.",
  "frontend/src/components/valentine/FloatingHearts.tsx": "Generates animated floating heart emojis with reduced‑motion support.",
  "frontend/src/components/valentine/RosePetalOverlay.tsx": "Creates animated falling rose petals with randomized motion and a static fallback for reduced‑motion users.",
  "frontend/src/components/valentine/RotatingOneLiners.tsx": "Cycles through a list of cute one‑liners with pause‑on‑hover behavior and reduced‑motion detection.",
  "frontend/src/components/valentine/SurpriseReveal.tsx": "Interactive gift‑reveal component that shows a coupon book and playlist link after activation.",
  "frontend/src/components/valentine/useIntroOverlayAudio.ts": "Hook that initializes ambient and confirmation audio, manages mute and first-interaction logic, and provides methods to play sounds.",
  "frontend/src/components/valentine/ValentineBackgroundMusic.tsx": "React component that loads, manages, and cleans up looping background music with mute control and interaction-based autoplay handling.",
  "frontend/src/components/valentine/ValentineIntroOverlay.tsx": "Intro overlay with audio controls and an evasive 'No' button, triggering ambient audio and a confirmation sound on acceptance.",
  "frontend/src/deployDiagnostics.ts": "Diagnostics module that logs environment details, tracks resource load errors, global errors, unhandled rejections, and page lifecycle events.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication state, exposing identity, login/clear actions, and login status flags.",
  "frontend/src/index.css": "Defines Tailwind layers, global CSS variables, and Valentine-themed colors plus custom components like valentine-card and valentine-badge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, importing global styles.",
  "frontend/src/utils/assetBase.ts": "Provides a helper to build correct asset URLs using Vite's BASE_URL, ensuring SPA compatibility.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color tokens, Valentine palette, fonts, shadows, and plugins for typography, container queries, and animation.",
  "project_state.json": "Tracks project state, requirements, issues, and architectural notes for the Valentine’s website build."
}