{
  "backend/main.mo": "Minimal Motoko canister containing an empty actor.",
  "feature_evidence.json": "JSON report listing implemented Valentine-related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing major Valentine UI components and styling.",
  "frontend/index.css": "Tailwind base/theme configuration defining Valentine color tokens, dark mode values, and global styles.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app.",
  "frontend/src/App.tsx": "Main React page orchestrating the Valentine experience including intro overlay, hero content, animations, and surprise reveal.",
  "frontend/src/components/valentine/FloatingHearts.tsx": "Generates animated floating hearts with reduced‑motion support.",
  "frontend/src/components/valentine/RosePetalOverlay.tsx": "Creates animated falling rose petals or static petals when reduced‑motion is enabled.",
  "frontend/src/components/valentine/RotatingOneLiners.tsx": "Cycles through playful one‑liners with pause‑on‑hover and reduced‑motion support.",
  "frontend/src/components/valentine/SurpriseReveal.tsx": "Interactive gift button that reveals a Valentine coupon book with animated transitions.",
  "frontend/src/components/valentine/useIntroOverlayAudio.ts": "Custom hook managing ambient and confirmation audio playback with mute state and user interaction unlocking.",
  "frontend/src/components/valentine/ValentineIntroOverlay.tsx": "Intro overlay component with ambient audio, mute control, and an evasive 'No' button that moves away from the pointer.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication state, login, logout, and stored identities.",
  "frontend/src/index.css": "Tailwind base styles plus Valentine-themed color variables and custom component styles.",
  "frontend/src/main.tsx": "Application entry point that mounts React, setting up React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, and Valentine-specific theme values with plugins.",
  "project_state.json": "JSON describing the current Valentine’s website project state, listing implemented features, requirements, and metadata. Includes introductory screen addition and flags indicating the file represents a fix request and project version info."
}