{
  "kind": "build_request",
  "title": "Import provided MP3 into app so background music plays",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Download the MP3 from https://image2url.com/r2/default/audio/1770895970075-efc8efc8-d8ca-4014-a506-846ed3573d6b.mp3 and commit it into the repository as a static asset at frontend/public/assets/audio/i-wanna-be-yours.mp3 so the existing background-music code (getAssetUrl('audio/i-wanna-be-yours.mp3')) can load it in production without relying on the external URL at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "bro are u really adding in the music this link: https://image2url.com/r2/default/audio/1770895970075-efc8efc8-d8ca-4014-a506-846ed3573d6b.mp3 cuz i dont hear anything at all",
          "yes add it"
        ]
      },
      "acceptanceCriteria": [
        "The file frontend/public/assets/audio/i-wanna-be-yours.mp3 exists in the repo and is included in the production build output under the correct base path.",
        "In a production deployment, after the user has accepted the intro overlay and performs a user interaction to unmute, background music plays audibly and loops (no 404s for the MP3 in the browser Network tab).",
        "The app does not attempt to load background music from the external URL at runtime; it loads only via getAssetUrl('audio/i-wanna-be-yours.mp3').",
        "When navigating away/closing the tab/unmounting the app, the background music stops (no continuing audio playback)."
      ]
    }
  ],
  "constraints": [
    "Frontend files listed as immutable by the system must not be edited (compose instead).",
    "Do not hotlink the MP3 at runtime; ship it as a static asset in frontend/public/assets/audio/.",
    "Keep asset loading SPA base-path safe by continuing to use getAssetUrl(...) for audio file paths."
  ],
  "nonGoals": [
    "Changing the existing background-music UX/controls or autoplay/unmute behavior beyond what is necessary to make the audio file actually present and loadable.",
    "Adding any backend storage or serving for audio files."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}