{
  "kind": "build_request",
  "title": "Add romantic sound effects, update one-liner text, and fix intro overlay blur/layout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Add romantic sound effects to the Valentine intro experience (the rose-petal “Will you be my Valentine?” overlay) in a way that works with browser autoplay rules (i.e., sound plays only after a user interaction). Include at least: (1) a subtle ambient romantic background audio while the intro overlay is visible, and (2) a short confirmation sound when the user clicks “Yes! 💖”. Provide a simple, visible mute/unmute control on the intro overlay and default to muted until the first user interaction enables audio.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "yes do add some romantic sound effects"
        ]
      },
      "acceptanceCriteria": [
        "When the intro overlay first appears, no audio plays automatically before any user interaction.",
        "After a user interaction (e.g., tap/click on the overlay), ambient romantic audio can play while the intro overlay remains visible.",
        "Clicking “Yes! 💖” plays a short romantic confirmation sound effect exactly once and then proceeds to the main page as before.",
        "A clear mute/unmute control is present on the intro overlay; when muted, no sounds play.",
        "Audio/sound effects do not block navigation and do not interfere with reduced-motion behavior."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Replace the hero sub-line “I like you more than I like hitting snooze on Monday mornings (and that's saying A LOT).” with the exact text: “I like you more than Hange liked titans.”",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "add one line instead of hitting snooze on monday line replace with I like you more than Hange liked titans."
        ]
      },
      "acceptanceCriteria": [
        "The old “hitting snooze on Monday mornings” line no longer appears anywhere on the site.",
        "The hero sub-line appears exactly as: “I like you more than Hange liked titans.”"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the “Will you be my Valentine?” intro overlay visuals to remove any background blur and make it feel like a clean, full-screen single-screen overlay (not a weird blurred layer over the page). Specifically remove the blur effect behind the overlay and ensure the overlay has a solid/clean full-screen backdrop so the underlying page is not visually competing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Also the screen with the question will u be my valentine pls remove the blur effect from the back and amke it complete single screen it looks weird"
        ]
      },
      "acceptanceCriteria": [
        "The intro overlay no longer applies a backdrop blur effect to the content behind it.",
        "The intro overlay reads as a clean full-screen experience (solid/clean background) with the rose petal animation still visible.",
        "The overlay remains responsive on mobile and desktop and retains accessible dialog semantics (role/aria attributes still valid)."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and the hooks listed in frontend.immutablePaths must not be edited.",
    "Do not add or require any backend changes (backend/main.mo should remain without new logic unless strictly necessary).",
    "All user-facing text must remain in English."
  ],
  "nonGoals": [
    "Adding new backend persistence or user profiles for audio settings.",
    "Adding third-party audio streaming/integrations.",
    "Changing the existing intro overlay Yes/No interaction design beyond removing blur and improving the full-screen feel."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}